package mo.cr.ui
{
   //============================================================
   // <T>界面可停泊接口。</T>
   //============================================================
   public interface IUiDockable
   {
      //============================================================
      // <T>获得可拖拽对象。</T>
      //
      // @return 可拖拽对象
      //============================================================
      function get dragControl():IUiDragable;
      
      //============================================================
      // <T>设置可拖拽对象。</T>
      //
      // @param p:drag 可拖拽对象
      //============================================================
      function set dragControl(p:IUiDragable):void;
      
      //============================================================
      // <T>测试是否可以提供拖拽对象。</T>
      //
      // @param p:drag 拖拽对象
      // @return 是否可以停留
      //============================================================
      function testDragable(p:IUiDragable):Boolean;

      //============================================================
      // <T>测试目标对象是否可以停留。</T>
      //
      // @param p:drag 拖拽对象
      // @return 是否可以停留
      //============================================================
      function testDockable(p:IUiDragable):Boolean;
   }
}