package mo.cm.console.synchronizer
{
   //============================================================
   // <T>同步接口。</T>
   //============================================================
   public interface ISynchronizer
   {
      //============================================================
      // <T>同步是否完毕。</T>
      //
      // @param p:args 参数集合
      // @return 是否完毕
      //============================================================
      function synchronizerReady(p:SSynchronizerArgs):Boolean;

      //============================================================
      // <T>获得同步比率。</T>
      //
      // @param p:args 参数集合
      // @return 处理结果
      //============================================================
      function synchronizerRate(p:SSynchronizerArgs):Boolean;
   }
}