package mo.cm.console.synchronizer
{
   //============================================================
   // <T>同步参数。</T>
   //============================================================
   public class SSynchronizerArgs
   {
      // 当前累积
      public var current:int;
      
      // 总共累积
      public var total:int;
      
      //============================================================
      // <T>构造同步参数。</T>
      //============================================================
      public function SSynchronizerArgs(){
      }
      
      //============================================================
      // <T>重置处理。</T>
      //============================================================
      public function reset():void{
         current = 0;
         total = 0;
      }
   }
}