package mo.cm.lang
{
   //============================================================
   // <T>对象集合工具类。</T>
   //============================================================
   public final class RVector
   {
      //============================================================
      // <T>构造对象集合工具类。</T>
      //============================================================
      public function RVector(){
      }

      //============================================================
      // <T>清空集合对象。</T>
      //
      // @param p:vector 集合对象
      //============================================================
      public static function clear(p:*):*{
         if(null != p){
            var v:Vector.<*> = p as Vector.<*>;
            if(null != v){
               var c:int = v.length;
               for(var n:int = 0; n < c; n++){
                  v[n] = null;
               }
               v.length = 0;
            }
            p = null;
         }
         return p;
      }
   }
}