package mo.cr.console.worker
{
   import mo.cm.lang.FObject;
   
   //============================================================
   // <T>工作器。</T>
   //============================================================
   public class FCrWorker extends FObject
   {
      // 类型
      public var typeCd:int;

      // 忙标志
      public var busy:Boolean;
      
      // 准备好
      public var ready:Boolean;

      //============================================================
      // <T>构造工作器。</T>
      //============================================================
      public function FCrWorker(){
      }
      
      //============================================================
      // <T>打开处理。</T>
      //============================================================
      public function open():void{
         busy = true;
         ready = false;
      }

      //============================================================
      // <T>过程处理。</T>
      //============================================================
      public function process():void{
      }

      //============================================================
      // <T>关闭处理。</T>
      //============================================================
      public function close():void{
         busy = false;
         ready = false;
     }
   }
}