package mo.cm.persistence
{
   //============================================================
   // <T>持久化接口。</T>
   //============================================================
   public interface IPersistence
   {
      //============================================================
      // <T>获得持久化键。</T>
      //
      // @return 持久化键
      //============================================================
      function get persistenceKey():String;

      //============================================================
      // <T>读取持久化数据。</T>
      //
      // @param p:storage 持久化数据
      // @return 处理结果
      //============================================================
      function persistenceRead(p:Object):Boolean;

      //============================================================
      // <T>写入持久化数据。</T>
      //
      // @param p:storage 持久化数据
      // @return 处理结果
      //============================================================
      function persistenceWrite(p:Object):Boolean;
   }
}