package mo.cm.console.monitor
{
   import mo.cm.system.RSystem;

   //============================================================
   // <T>释放监视处理。</T>
   //============================================================
   public class FMonitorGc extends FMonitor
   {
      //============================================================
      // <T>构造释放监视处理。</T>
      //============================================================
      public function FMonitorGc(){
         intervalTick = 60000;
      }
      
      //============================================================
      // <T>执行处理。</T>
      //============================================================
      public override function execute():void{
         RSystem.gc();
      }
   }
}