package mo.cm.reflection
{
   //============================================================
   // <T>类信息。</T>
   //============================================================
   public class SClassInfo
   {
      // 实体集合
      public var instances:Vector.<Object> = new Vector.<Object>();
      
      //============================================================
      // <T>构造类信息。</T>
      //============================================================
      public function SClassInfo(){
      }
   }
}