package mo.cm.console.resource
{
   //============================================================
   // <T>资源提供商接口。</T>
   //============================================================
   public interface IResourceVendor
   {
      //============================================================
      // <T>创建资源域。</T>
      //
      // @return 资源域
      //============================================================
      function createDomain():FResourceDomain;
      
      //============================================================
      // <T>创建资源组。</T>
      //
      // @return 资源组
      //============================================================
      function createGroup():FResourceGroup;

      //============================================================
      // <T>创建资源对象。</T>
      //
      // @param pd:domainName 域名称
      // @param pt:typeName 类型名称
      // @return 资源对象
      //============================================================
      function create(pd:String, pt:String):FResource;

      //============================================================
      // <T>生成网络地址。</T>
      //
      // @param p:resource 资源
      //============================================================
      function makeUrl(p:IResource):String;
   }
}