package mo.cm.console.resource
{
   //============================================================
   // <T>资源数据提供商接口。</T>
   //============================================================
   public interface IResourceDataVendor
   {
      //============================================================
      // <T>创建数据流。</T>
      //
      // @return 数据流
      //============================================================
      function createStream():FResourceStream;
      
      //============================================================
      // <T>释放数据流。</T>
      //
      // @param p:stream 数据流
      //============================================================
      function freeStream(p:FResourceStream):void;
   }
}