package mo.cm.system
{
   //============================================================
   // <T>未支持致命错误。</T>
   //============================================================
   public class FFatalUnsupportError extends FFatalError
   {
      //============================================================
      // <T>构造未支持致命错误。</T>
      //============================================================
      public function FFatalUnsupportError(){
         super("Unsupport error.");
      }
   }
}