package mo.cm.stream
{
   import flash.utils.ByteArray;
   
   //============================================================
   // <T>数据输入流。</T>
   //============================================================
   public class FInputStream extends FInput
   {
      //============================================================
      // <T>构造数据输入流。</T>
      //============================================================
      public function FInputStream(){
         super(new ByteArray());
      }
      
      //============================================================
      // <T>释放资源。</T>
      //============================================================
      public override function dispose():void{
         memory.clear();
         super.dispose();
      }
   }
}