package mo.cm.stream
{
   import mo.cm.core.device.RFatal;
   
   //============================================================
   // <T>关联数据流。</T>
   //============================================================
   public class FLinkStream extends FByteStream
   {
      // 是否关联
      public var linked:Boolean;
      
      //============================================================
      // <T>构造关联数据流。</T>
      //============================================================
      public function FLinkStream(){
      }
      
      //============================================================
      // <T>关联内存。</T>
      //============================================================
      public function link():void{
         // 检查是否已经关联
         if(linked){
            RFatal.throwFatal("Catch is already linked.");
         }
         // 关联处理
         linked = true;
         data.position = 0;
      }
      
      //============================================================
      // <T>确保内存大小。</T>
      //
      // @parma p:size 大小 
      //============================================================
      public function ensureSize(p:int):void{
         if(p >= data.length){
            data.length = p;
         }
      }
      
      //============================================================
      // <T>解除关联内存。</T>
      //============================================================
      public function unlink():void{
         linked = false;
      }
   }
}


