package mo.cm.console.transfer
{
   //============================================================
   // <T>传输提供商接口。</T>
   //============================================================
   public interface ITransferVendor
   {
      //============================================================
      // <T>生成网络地址。</T>
      //
      // @param ps:transferSource 传输来源
      // @param pd:transferData 传输数据
      //============================================================
      function makeUrl(ps:FTransferSource, pd:FTransferData):String;
      
      //============================================================
      // <T>创建传输器。</T>
      //
      // @return 传输器
      //============================================================
      function createTransfer():FTransfer;
   }
}