package mo.cr.message
{
   import mo.cm.stream.IInput;
   import mo.cm.stream.IOutput;
   
   public interface INetObject
   {
      //============================================================
      // <T>接收对象内容。</T>
      //
      // @param object 对象
      //============================================================
      function assign(object:Object):void;
      
      //============================================================
      // <T>序列化到输入流中。</T>
      //
      // @param output 输入流
      //============================================================
      function serialize(output:IOutput):void;
      
      //============================================================
      // <T>从输出流中反序列化。</T>
      //
      // @param input 输出流
      //============================================================
      function unserialize(input:IInput):Boolean;
      
      //============================================================
      // <T>重置内容。</T>
      //============================================================
      function reset():void;
   }
}