package mo.cm.lang
{
   import mo.cm.stream.IInput;
   import mo.cm.stream.IOutput;
   
   //============================================================
   // <T>无符号64位数据。</T>
   //============================================================
   public class SUint64
   {
      // 内容高32位
      public var value1:uint;
      
      // 内容低32位
      public var value2:uint;
      
      //============================================================
      // <T>构造无符号64位数据。</T>
      //============================================================
      public function SUint64(){
      }
      
      //============================================================
      // <T>序列化内部数据到输出流。</T>
      //
      // @param p:output 输出流
      //============================================================
      public function serialize(p:IOutput):void{
         p.writeInt32(value1);
         p.writeInt32(value2);
      }
      
      //============================================================
      // <T>反序列化输入流到内部数据。</T>
      //
      // @param p:input 输入流
      //============================================================
      public function unserialize(p:IInput):void{
         value1 = p.readInt32();
         value2 = p.readInt32();
      }
   }
}