package mo.cm.system
{
   import flash.geom.Point;

   //============================================================
   // <T>常量定义。</T>
   //============================================================
   public class RConstants
   {
      // 空点
      public static var emptyPoint:Point = new Point(0, 0);
      
      //============================================================
      // <T>构造常量定义。</T>
      //============================================================
      public function RConstants(){
      }
   }
}