package mo.cr.console.physical
{
   //============================================================
   // <T>物理项目。</T>
   //============================================================
   public class FCrPhysicalItem extends FCrPhysical
   {
      //============================================================
      // <T>构造物理项目。</T>
      //============================================================
      public function FCrPhysicalItem(){
      }

      //============================================================
      // <T>更新处理。</T>
      //
      // @param p:track 跟踪器
      //============================================================
      public function update(p:FCrPhysicalTracker):Boolean{
         return true;
      }
   }
}